Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memtrad-tecnicasTA-usosTA.tmx
Source language: ca
Languages: es_es

source: L'elecció de la profunditat de l'anàlisi s'ha de fonamentar en la naturalesa i la profunditat de les divergències de traducció {vandooren93b} entre les llengües implicades.
es_es: La elección de la profundidad del análisis se tiene que fundamentar en la naturaleza y la profundidad de las divergencias de traducción {vandooren93b} entre las lenguas implicadas.

source: L'entusiasme va fer que es finançaren un gran nombre de projectes entre la meitat dels 50 i la meitat dels 60, projectes dins els quals van nàixer la major part de les tècniques actuals, com ara la traducció indirecta per transferència o la traducció per interlingua (vegeu el capítol ).
es_es: El entusiasmo hizo que se financiaran un gran número de proyectos entre la mitad de los 50 y la mitad de los 60, proyectos dentro de los que nació la mayor parte de las técnicas actuales, como la traducción indirecta por transferencia o la traducción por interlingua (véase el capítulo ).

source: L'escriptor de llenguatges controlats usa normalment un editor de textos intel·ligent que fa les següents tasques: Comprovar el compliment de les restriccions: terminològiques (com el cas del mot replace esmentat més amunt; per a això, pot ser útil accedir a una base de dades terminològica, com les esmentades en el capítol ); sintàctiques (per exemple, fent l'anàlisi sintàctica de les oracions i detectant les ambigüitats estructurals, vegeu l'apartat ), i d'estil (per exemple, especificant quin ha de ser el format de les dates o de les hores).
es_es: El escritor de lenguajes controlados usa normalmente un editor de textos inteligente que realiza las siguientes tareas: Comprobar el cumplimiento de las restricciones: terminológicas (como el caso de la palabra replace mencionado más arriba; para eso, puede ser útil acceder a una base de datos terminológica, como las mencionadas en el capítulo ); sintácticas (por ejemplo, haciendo el análisis sintáctico de las oraciones y detectando las ambigüedades estructurales, véase el apartado ), y de estilo (por ejemplo, especificando cuál debe ser el formato de las fechas o de las horas).

source: L'estratègia directa s'anomena així perquè la traducció d'una frase es produeix directament, sense que es genere una representació intermèdia de la frase; de vegades també se sol anomenar vagament traducció mot per mot.
es_es: La estrategia directa se llama así porque la traducción de una frase se produce directamente, sin que se genere una representación intermedia de la frase; a veces también se suele llamar vagamente traducción palabra por palabra.

source: L'estratègia indirecta produeix, a partir de la frase en LO, una representació intermèdia de la frase que després s'usa per a traduir-la.
es_es: La estrategia indirecta produce, a partir de la frase en LO, una representación intermedia de la frase que después se usa para traducirla.

source: L'estratègia de transferència morfològica avançada es pot veure com una formalització de l'estratègia mal anomenada directa que s'usava en els programes de traducció automàtica de primera generació (anys cinquanta i seixanta del segle passat): anàlisi morfològica rudimentària, consulta del diccionari bilingüe, i ajustos locals com ara reordenaments.
es_es: La estrategia de transferencia morfológica avanzada se puede ver como una formalización de la estrategia mal nombrada directa que se usaba en los programas de traducción automática de primera generación (años cincuenta y sesenta del siglo pasado): análisis morfológico rudimentario, consulta del diccionario bilingüe, y ajustes locales como por ejemplo reordenamientos.

source: L'estratègia de transferència sintàctica resol una bona part dels problemes dels sistemes directes i dels de transferència morfològica, ja que és capaç de determinar l'extensió i l'estructura de cada un dels sintagmes de la frase en LO i manipular cada sintagma com una unitat, independentment de l'estructura o de la longitud.
es_es: La estrategia de transferencia sintáctica resuelve una buena parte de los problemas de los sistemas directos y de los de transferencia morfológica, ya que es capaz de determinar la extensión y la estructura de cada uno de los sintagmas de la frase en LO y manipular cada sintagma como una unidad, independientemente de la estructura o de la longitud.

source: L'estructura d'aquest sintagma nominal es podria representar, usant un arbre d'anàlisi sintàctica (sense tenir en compte els determinants, per a simplificar) com es veu en la figura .
es_es: La estructura de este sintagma nominal se podría representar, usando un árbol de análisis sintáctico (sin tener en cuenta los determinantes, para simplificar) como se ve en la figura .

source: L'informe assegurava que la TA era més lenta i menys exacta que la feta pels humans, a més de ser el doble de cara, i que no hi havia cap indici de l'obtenció en el futur més o menys inmediat d'un sistema de TA útil.
es_es: El informe aseguraba que la TA era más lenta y menos exacta que la realizada por los humanos, además de ser el doble de cara, y que no había ningún indicio de la obtención en el futuro más o menos inmediato de un sistema de TA útil.

source: L'informe va fer que es reduira significativament el nombre de persones que es dedicaven a la TA i que els laboratoris començaren a treballar en el que es va conéixer com a lingüística computacional.
es_es: El informe hizo que se redujera significativamente el número de personas que se dedicaban a la TA y que los laboratorios empezaran a trabajar en lo que se conoció como lingüística computacional.

source: L'objectiu era el desenvolupament de sistemes perfectes.
es_es: El objetivo era el desarrollo de sistemas perfectos.

source: L'objectiu no és obtenir un sistema de traducció perfecta, sinó un sistema adequat per a aplicacions amb llenguatges, dominis i usuaris restringits.
es_es: El objetivo no es obtener un sistema de traducción perfecta, sino un sistema adecuado para aplicaciones con lenguajes, dominios y usuarios restringidos.

source: L'ús d'un llenguatge controlat fa que l'escriptura siga més ràpida.
es_es: El uso de un lenguaje controlado hace que la escritura sea más rápida.

source: L'ús de la taula permet construir el programa analitzador independentment de la gramàtica concreta: si canvia la gramàtica, només canvia la taula.
es_es: El uso de la tabla permite construir el programa analizador independientemente de la gramática concreta: si cambia la gramática, sólo cambia la tabla.

source: La traducció automàtica basada en exemples intenta construir plantilles de traducció a partir dels exemples observats en el corpus d'oracions paral·leles i generalitzar-les perquè servisquen en noves situacions.
es_es: La traducción automática basada en ejemplos intenta construir plantillas de traducción a partir de los ejemplos observados en el corpus de oraciones paralelas y generalizarlas para que sirvan en nuevas situaciones.

source: La Acadèmia Nacional de les Ciències dels Estats Units va publicar el 1966 l'informe ALPAC (Automatic Language Processing Advisory Committee) en el qual es recomanava que els nombrosos recursos que es dedicaven a la recerca en TA s'utilitzaren per a tasques menys ambicioses i més bàsiques relacionades amb el processament del llenguatge natural i amb el desenvolupament d'eines de suport per als traductors com ara diccionaris automàtics.
es_es: La Academia Nacional de las Ciencias de los Estados Unidos publicó en 1966 el informe ALPAC (Automatic Language Processing Advisory Committee) en el cual se recomendaba que los numerosos recursos que se dedicaban a la investigación en TA se utilizaran para tareas menos ambiciosas y más básicas relacionadas con el procesamiento del lenguaje natural y con el desarrollo de herramientas de apoyo para los traductores como por ejemplo diccionarios automáticos.

source: La capacitat d'un sistema de transferència morfològica per a produir traduccions acceptables dependrà de la seua capacitat per a detectar seqüències de mots que es corresponguen amb els sintagmes que necessiten ser reordenats.
es_es: La capacidad de un sistema de transferencia morfológica para producir traducciones aceptables dependerá de su capacidad para detectar secuencias de palabras que se correspondan con los sintagmas que necesitan ser reordenados.

source: La combinació d'algunes d'aquestes eines en un programari concret és el que es coneix com estacions de treball per a traductors; per exemple, el Translation Manager d'IBM, recentment alliberat com a programari lliure/de codi font obert amb el nom OpenTM2, {http://www.opentm2.org}, o el Translator Workbench de Trados, ara anomenat SDL Trados Studio.
es_es: La combinación de algunas de estas herramientas en un software concreto es el que se conoce como estaciones de trabajo para traductores; por ejemplo, el Translation Manager d'IBM, recientemente liberado como software libre/de código fuente abierto con el nombre OpenTM2, {http://www.opentm2.org}, o el Translator Workbench de Trados, ahora llamado SDL Trados Studio.

source: La combinació d'aquests models fa que la hipòtesi de traducció que rep la puntuació global més alta no siga necessàriament la hipòtesi de traducció millor segons cada model per separat.
es_es: La combinación de estos modelos hace que la hipótesis de traducción que recibe la puntuación global más alta no sea necesariamente la hipótesis de traducción mejor según cada modelo por separado.

source: La conclusió era que només després de conéixer les arrels del problema, podria estudiar-se la realització d'un sistema de TA real.
es_es: La conclusión era que sólo después de conocer las raíces del problema, podría estudiarse la realización de un sistema de TA real.

source: La definició inclou, per tant, el tractament i la producció de missatges no textuals (orals).
es_es: La definición incluye, por lo tanto, el tratamiento y la producción de mensajes no textuales (orales).

source: La fase de generació podria efectuar la substitució de les formes lèxiques de la LM per les corresponents formes superficials.
es_es: La fase de generación podría efectuar la sustitución de las formas léxicas de la LM por las correspondientes formas superficiales.

source: La fase de transferència pot consistir en un reordenament local (transferència estructural) d'algunes seqüències de mots (per exemple, quan es tradueix de l'anglés al català, els parells adjectiu--substantiu es podrien reordenar a substantiu--adjectiu) i en la conversió de les formes lèxiques de la LO en les corresponents de la LM mitjançant l'ús d'un diccionari bilingüe (transferència lèxica).
es_es: La fase de transferencia puede consistir en un reordenamiento local (transferencia estructural) de algunas secuencias de palabras (por ejemplo, cuando se traduce del inglés al catalán, los pares adjectivo--sustantivo se podrían reordenar a sustantivo--adjectivo) y en la conversión de las formas léxicas de la LO en las correspondientes de la LM mediante el uso de un diccionario bilingüe (transferencia léxica).

source: La figura il·lustra aquest procés amb un corpus menut de tres oracions paral·leles; si us fixeu, sense tenir cap coneixement de les llengües (perquè han estat inventades) les persones també som capaces d'obtenir aquests alineaments.
es_es: La figura ilustra este proceso con un corpus pequeño de tres oraciones paralelas; si os fijáis, sin tener ningún conocimiento de las lenguas (porque han sido inventadas) las personas también somos capaces de obtener estos alineamientos.

source: La figura il·lustra el cost d'afegir $L_4$ al sistema.
es_es: La figura ilustra el coste de añadir $L_4$ al sistema.

source: La idea fonamental es que el procés de traducció es pot fer sovint consultant traduccions anteriors i identificant frases o grups de mots en el corpus ja traduït.
es_es: La idea fundamental es que el proceso de traducción se puede hacer a menudo consultando traducciones anteriores e identificando frases o grupos de palabras en el corpus ya traducido.

source: La identificació de patrons de categories morfològiques que es corresponguen amb els sintagmes més freqüents pot servir, a més de per a fer reordenaments, per a resoldre la concordança de nombre i gènere.
es_es: La identificación de patrones de categorías morfológicas que se correspondan con los sintagmas más frecuentes puede servir, además de para hacer reordenamientos, para resolver la concordancia de número y género.

source: La major part d'aquestes estacions de treball estan disponibles per a ordinadors personals.
es_es: La mayor parte de estas estaciones de trabajo están disponibles para ordenadores personales.

source: La majoria dels sistemes de traducció automàtica basats en coneixement aborden la traducció com l'aplicació del principi de composicionalitat semàntica (PCS, capítol ), el qual afirma que la interpretació (el significat) d'una oració es construeix composicionalment a partir de les interpretacions dels mots, seguint els agrupaments dictats pel seu arbre d'anàlisi sintàctica, i també al revés, que les oracions es poden construir composicionalment a partir de les interpretacions {tellier00p}.
es_es: La mayoría de los sistemas de traducción automática basados en conocimientos abordan la traducción como la aplicación del principio de composicionalidad semántica (PCS, capítulo ), el cual afirma que la interpretación (el significado) de una oración se construye composicionalmente a partir de las interpretaciones de las palabras, siguiendo los agrupamientos dictados por su árbol de análisis sintáctico, y también a la inversa, que las oraciones se pueden construir composicionalmente a partir de las interpretaciones {tellier00p}.

source: La majoria dels sistemes de traducció automàtica, independentment de si són basats en regles o en corpus, adopten la que podrien anomenar aproximació oracional, segons la qual traduir texts és traduir oracions.
es_es: La mayoría de los sistemas de traducción automática, independientemente de si están basados en reglas o en corpus, adoptan lo que se podría llamar aproximación oracional, según la cual, traducir textos es traducir oraciones.

source: La multinacional WorldTrans ha decidit ampliar el seu sistema de traducció automàtica multilingüe LetTrans (que tradueix correspondència comercial entre qualssevol dues llengües d'un grup de quinze) i afegir-hi la capacitat de traduir del suahili a les quinze llengües i de les quinze llengües cap al suahili.
es_es: La multinacional WorldTrans ha decidido ampliar su sistema de traducción automática multilingüe LetTrans (que traduce correspondencia comercial entre dos lenguas cualquiera de un grupo de quince) y añadir la capacidad de traducir del swahili a las quince lenguas y de las quince lenguas hacia el swahili.

source: La postedició de la traducció realitzada per un traductor automàtic és sempre necessària per a usar-la amb finalitats de disseminació.
es_es: La postedición de la traducción realizada por un traductor automático es siempre necesaria para usarla con finalidades de diseminación.

source: La preedició sol ser tant més convenient quant a més llengües es traduïsca el text preeditat perquè un canvi al text origen pot estalviar tantes postedicions com llengües d'arribada tinguem.
es_es: La preedición suele ser más conveniente cuando a más lenguas se traduzca el texto preeditado porque un cambio al texto origen puede ahorrar tantas postediciones como lenguas de llegada tengamos.

source: La primera (d'entrada) indica la lletra que es llig; la segona (d'eixida) indica el que s'ha de produir (zero, un o més símbols).
es_es: La primera (de entrada) indica la letra que se lee; la segunda (de salida) indica lo que se debe producir (cero, uno o más símbolos).

source: La semàntica d'aquestes frases es podria resumir en l'estructura abstracta donarplaer(agent=llimons,dest=jo) Però encara pot haver-hi més maneres d'expressar sintàcticament el que a algú li produeix plaer fer una acció: la catalana m'agrada nadar o l'espanyola me gusta nadar, on l'acció de nadar és el subjecte i el receptor de plaer l'objecte indirecte; la de l'anglés I like swimming o el francés j'aime nager, on el receptor de plaer és subjecte i l'acció de nadar l'objecte; la del portugués, que introdueix l'acció amb preposició: eu gosto de nadar, o la neerlandesa ik swemme graag o l'alemanya ich schwimme gern on l'acció de nadar passa a ser el verb principal i l'acció d'agradar es converteix en un adverbi.
es_es: La semántica de estas frases se podría resumir en la estructura abstracta donarplaer(agente=llimons,dest=jo) Pero todavía puede haber más formas de expresar sintácticamente el que a alguien le produce placer hacer una acción: la catalana m'agrada nadar o la española me gusta nadar, donde la acción de nadar es el sujeto y el receptor de placer, el objeto indirecto; la del inglés I like swimming o el francés j'aime nager, donde el receptor de placer es sujeto y la acción de nadar, el objeto; la del portugués, que introduce la acción con preposición: eu gosto de nadar, o la neerlandesa ik swemme graag o la alemana ich schwimme gern donde la acción de nadar pasa a ser el verbo principal y la acción de gustar se convierte en un adverbio.

source: La sintaxi es defineix normalment, no en termes de mots, sinó en termes de categories lèxiques.
es_es: La sintaxis se define normalmente, no en términos de palabras, sino en términos de categorías léxicas.

source: La sintaxi generativa actual (vegeu , ) prediu molts aspectes de les llengües naturals postulant l'existència d'un conjunt de regles universals molt senzilles o principis amb variacions que en cada llengua estan determinades per paràmetres; la gramàtica que es considera en aquesta discussió no és, en principi, la postulada per aquesta formulació, sinó una adequada per a la tasca concreta.
es_es: La sintaxis generativa actual (véase , ) predice muchos aspectos de las lenguas naturales postulando la existencia de un conjunto de reglas universales muy sencillas o principios con variaciones que en cada lengua están determinadas por parámetros; la gramática que se considera en esta discusión no es, en principio, la postulada por esta formulación, sino una adecuada para la tarea concreta.

source: La traducció automàtica (TA) es pot definir com el procés (o el producte) de traduir un text informatitzat en una llengua origen a un text informatitzat en una llengua meta mitjançant l'ús d'un programa d'ordinador.
es_es: La traducción automática (TA) se puede definir como el proceso (o el producto) de traducir un texto informatizado en una lengua origen a un texto informatizado en una lengua meta mediante el uso de un programa de ordenador.

source: La traducció automàtica instantània de pàgines web durant la navegació és un cas de traducció automàtica{} {} amb preedició.
es_es: La traducción automática instantánea de páginas web durante la navegación es un caso de traducción automática{} {} con preedición.

source: La traducció automàtica per a la disseminació és especialment eficient quan només es tradueixen textos pertanyents a una part molt reduïda i ben regulada de l'idioma en qüestió (un subllenguatge).
es_es: La traducción automática para la diseminación es especialmente eficiente cuando sólo se traducen textos pertenecientes a una parte muy reducida y muy regulada del idioma en cuestión (un sublenguaje).

source: La traducció automàtica per transferència és sempre... ... morfològica.
es_es: La traducción automática por transferencia es siempre... ... morfológica.

source: La traducció automàtica produeix resultats que normalment no poden substituir directament els produïts per professionals de la traducció (vegeu el capítol ).
es_es: La traducción automática produce resultados que normalmente no pueden sustituir directamente los producidos por profesionales de la traducción (véase el capítulo ).

source: La traducció automàtica, tot i ser molt diferent de les traduccions fetes per professionals competents, pot ser una eina molt útil en aquests dos grups d'aplicacions.
es_es: La traducción automática, a pesar de ser muy diferente de las traducciones hechas por profesionales competentes, puede ser una herramienta muy útil en estos dos grupos de aplicaciones.

source: La { generació} morfològica fa l'operació inversa.
es_es: La { generación} morfológica hace la operación inversa.

source: Les categories lèxiques (o simplement categories) són conjunts de mots que tenen la mateixa funció sintàctica; hi ha categories majors, lèxiques o de classe oberta (substantiu, adjectiu, verb, etc.) que creixen quan s'afig nou lèxic a la llengua i categories menors, gramaticals o de classe tancada (articles, conjuncions, etc.), que no creixen i contenen mots amb funció gramatical.
es_es: Las categorías léxicas (o simplemente categorías) son conjuntos de palabras que tienen la misma función sintáctica; hay categorías mayores, léxicas o de clase abierta (substantivo, adjetivo, verbo, etc.) que crecen cuando se añade léxico nuevo a la lengua y categorías menores, gramaticales o de clase cerrada (artículos, conjunciones, etc.), que no crecen y contienen palabras con función gramatical.

source: Les entitats $RA_1$ a $RA_4$ són les representacions abstractes (tant RALO com RALM) que usen els mòduls de transferència.} En canvi, en un sistema d'interlingua no hi ha mòduls de transferència; un sistema trilingüe basat en una interlingua tindria només sis mòduls: tres d'anàlisi ($A'_1$, $A'_2$ i $A'_3$) i tres de generació ($G'_1$, $G'_2$ i $G'_3$).
es_es: Las entidades $RA_1$ a $RA_4$ son las representaciones abstractas (tanto RALO como RALM) que usan los módulos de transferencia.} En cambio, en un sistema de interlingua no hay módulos de transferencia; un sistema trilingüe basado en una interlingua tendría sólo seis módulos: tres de análisis ($A'_1$, $A'_2$ y $A'_3$) y tres de generación ($G'_1$, $G'_2$ y $G'_3$).

source: Les estratègies de traducció automàtica es poden dividir en dos grans grups, les directes i les indirectes.
es_es: Las estrategias de traducción automática se pueden dividir en dos grandes grupos, las directas y las indirectas.

source: Les figures , i il·lustren el funcionament de les fases d'anàlisi, transferència i generació, respectivament, d'un sistema de transferència morfològica avançada (és a dir, amb reconeixement de patrons senzills que representen sintagmes) de l'anglés al català.
es_es: Las figuras , y ilustran el funcionamiento de las fases de análisis, transferencia y generación, respectivamente, de un sistema de transferencia morfológica avanzada (es decir, con reconocimiento de patrones sencillos que representan sintagmas) del inglés al catalán.

source: Les fletxes que ixen d'un vèrtex qualsevol del graf tenen dues etiquetes separades per ``{ :}''.
es_es: Las flechas que salen de un vértice cualquiera del grafo tienen dos etiquetas separadas por ``{ :}''.

source: Les interlingües poden ser de molts tipus.
es_es: Las interlinguas pueden ser de muchos tipos.

source: Les mancances de la traducció automàtica es poden compensar amb preguntes o dient les coses d'una altra manera fins que els dos interlocutors s'entenguen (és a dir, mitjançant una negociació).
es_es: Las faltas de la traducción automática se pueden compensar con preguntas o diciendo las cosas de otro modo hasta que los dos interlocutores se entiendan (es decir, mediante una negociación).

source: Les modificacions poden ser: esborrats d'un mot que sobra, substitucions d'un mot per un altre, o insercions d'un mot que falta.
es_es: Las modificaciones pueden ser: borrados de una palabra que sobra, sustituciones de una palabra por otra, o inserciones de una palabra que falta.

source: Les preguntes es poden plantejar com en el problema .
es_es: Las preguntas se pueden plantear como en el problema .
